artillery.yaml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/todos"
          json:
            title: "Test"
            description: "testing testing"
            completed: true
      - get:
          url: "/todos"